common/widgets/DatesNews.php

SELECT `id`, `date` FROM `news`
---
    public function  init(){
        parent::init();
        $this->news = News::find()->select('id,date')->all();