frontend/modules/news/controllers/DefaultController.php

SELECT COUNT(*) FROM `news`
SELECT `id`, `date`, `captiopn`, `preview` FROM `news` ORDER BY `date` DESC LIMIT 5 OFFSET 5
---
    public function actionIndex()
    {
        $query = News::find()->select('id, date, captiopn, preview');
        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count()
        ]);
        $news = $query->orderBy(['date'=> SORT_DESC])
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();

SELECT `id`, `date`, `captiopn`, `preview` FROM `news` WHERE `date` BETWEEN '2016-04-01' AND '2016-04-31'
---
    public function actionView($id)
    {
        return $this->render('view', [
            'model' => $this->findModel($id),
        ]);
    }
    public function actionMonth($date)
    {
        $model = News::find()->select('id, date, captiopn, preview')
                ->andWhere(['between', 'date', $date.'-01', $date.'-31'])//'date > :date',[':date'=>$date.'-01'])

SELECT `id`, `date`, `captiopn`, `preview` FROM `news` WHERE `theme_id`='1'
---
    public function actionTheme($id)
    {
        $model = News::find()->select('id, date, captiopn, preview')->where(['theme_id'=>$id])->all();

SELECT `news`.* FROM `news` LEFT JOIN `themes` ON `news`.`theme_id` = `themes`.`id` WHERE `news`.`id`='8'
---
    protected function findModel($id)
    {
        if (($model = News::find()->where(['news.id'=>$id])->joinWith('theme')->one()) !== null) {