backend/modules/news/controllers/NewsController.php

INSERT INTO `news` (`date`, `theme_id`, `captiopn`, `text`, `preview`) VALUES ('2016-04-23', 1, 'dsfgs', 'sdfg sdg sdfg sf gsg sdg s', '')
---
    public function actionCreate()
    {
        $model = new News();
        $themesList = $this->getThemes();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `themes`
---
    private function getThemes(){
        $themes = \common\models\Themes::find()->all();

SELECT * FROM `news` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = News::findOne($id)) !== null) {